# run me with
# brew bundle install

# Taps
tap 'qmk/qmk' # QMK
tap 'albertlauncher/albert' # Albert launcher
tap 'nikitabobko/tap' # Aerospace tiling window manager macOS

brew 'asdf' # prog-lang version manager
brew 'bash' # newer bash version on macOS for tmux tokyo-night theme
brew 'bat' # smarter cat with syntax highlighting
brew 'difftastic'
brew 'eslint'
brew 'eslint_d'
brew 'fd' # faster, colorized alternative to find
brew 'fish' # my friendly shell
brew 'fzf' # fuzzy finder that powers fzf.fish plugin
brew 'fzf-make' # faster version of fzf (fzf-native) for vim telescope plugin
brew 'go'
brew 'jq' # cli json tool
brew 'lua-language-server'
brew 'luarocks'
brew 'neovim'
brew 'node'
brew 'prettier'
brew 'prettierd'
brew 'pyright'
brew 'qmk' # keyboard firmware
brew 'ripgrep'
brew 'ruby'
brew 'rust'
brew 'rustfmt'
brew 'rust-analyzer'
brew 'selene'
brew 'stow'
brew 'stylua'
brew 'tvnamer'
brew 'typescript-language-server'
brew 'wget'
brew 'zellij'

# Install fonts
cask 'font-jetbrains-mono-nerd-font'
cask 'aerospace'
